# Exploratory Data Analysis - Part 1

    - Employee Salaries (salaries.csv)

### Import Pandas

In [7]:
import pandas as pd

### Read CSV Datasets

In [8]:
df_salary = pd.read_csv('../../../Data Sets/salaries.csv')
df_salary

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

### Check the head of the dataframe

In [9]:
df_salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### Check how many entries

In [11]:
df_salary.info() # number of columns and number of row entries

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

### What is the average base pay?

In [12]:
df_salary['BasePay'].mean()

66325.44884050643

### What is the highest amount of OvertimePay in the dataset?

In [14]:
df_salary['OvertimePay'].max()

245131.88

### What is the job titleof Joseph Driscoll?

In [22]:
df_salary[df_salary['EmployeeName'] == 'Joseph Driscoll']['JobTitle']

36198    Captain, Fire Suppression
Name: JobTitle, dtype: object

### How much does Joseph Driscoll make including benefits?

In [26]:
df_salary[df_salary['EmployeeName'] == 'Joseph Driscoll']['TotalPayBenefits']

36198    331834.79
Name: TotalPayBenefits, dtype: float64

### Who is the highest paid person including benefits?

In [38]:
df_salary[df_salary['TotalPayBenefits'] == df_salary['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [60]:
# Alternative

df_salary.sort_values(by = 'TotalPayBenefits', ascending = False)[['EmployeeName', 'TotalPayBenefits']].head(1)

     EmployeeName  TotalPayBenefits
0  NATHANIEL FORD         567595.43

### Who is the lowest paid person including benefits?

In [62]:
df_salary[df_salary['TotalPayBenefits'] == df_salary['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

### What was the average BasePay of all employees per year? (2011 - 2014)

In [80]:
df_salary.groupby(by = 'Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

### What was the average BasePay of all employees per year? (2011, 2013 only)

In [87]:
df_filtered = df_salary.groupby(by = 'Year').mean()
df_filtered = df_filtered.query("Year == '2011' | Year == '2013'")
df_filtered['BasePay']

Year
2011    63595.956517
2013    69630.030216
Name: BasePay, dtype: float64

### How many unique job titles are there?

In [89]:
df_salary['JobTitle'].nunique() # or len(df_salary['JobTitle'].unique)

2159

### What are the top 3 most common jobs?

In [110]:
df_salary['JobTitle'].value_counts().head(3)

# long method --> df_salary.groupby('JobTitle').count().sort_values('Id', ascending = False).head(3)

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
JobTitle,,,,,,,,,,,,
Transit Operator,7036,7036,6975,7036,7036,7036,7036,7036,7036,0,7036,0
Special Nurse,4389,4389,4382,4389,4389,4389,4389,4389,4389,0,4389,0
Registered Nurse,3736,3736,3725,3736,3736,3736,3736,3736,3736,0,3736,0

### How many Job Titles were represented by only one person in 2013?

In [95]:
(df_salary[df_salary['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

### How many people have the word 'Chief' in their job title?

In [112]:
def find_chief(title):
    
    if 'chief' in title.lower().split():
    
        return True
    
    else:
        
        return False

In [116]:
df_salary['JobTitle'].apply(lambda x: find_chief(x)).sum()

477

### Is there a correlation between length of the Job Title and Salary

     - This is an advanced question, a preview of next semester :-)
     - 1 Perfect (+ rel), 0.8 (+ fairly), 0.6 (+ moderate), 0 (none)

In [123]:
df_salary['Title Length'] = df_salary['JobTitle'].apply(len)
df_salary[['JobTitle','Title Length']]

                                              JobTitle  Title Length
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY            46
1                      CAPTAIN III (POLICE DEPARTMENT)            31
2                      CAPTAIN III (POLICE DEPARTMENT)            31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC            36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)            44
...                                                ...           ...
148649                                       Custodian             9
148650                                    Not provided            12
148651                                    Not provided            12
148652                                    Not provided            12
148653                      Counselor, Log Cabin Ranch            26

[148654 rows x 2 columns]

In [125]:
df_salary[['TotalPayBenefits','Title Length']].corr()

                  TotalPayBenefits  Title Length
TotalPayBenefits          1.000000     -0.036878
Title Length             -0.036878      1.000000

In [126]:
# There is no correlation between Title Length and TotalPayBenefits